## Flight Price Analysis and Prediction

### Analytic Dashbord
https://public.tableau.com/app/profile/nihar.ranjan7808/viz/FlightDataAnalysis_16795885798140/FlightDataAnalysis?publish=yes

In [1]:
#importing besic libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
train_df=pd.read_excel('F:\\1.Study Materials\\kaggel\\Flight fare prediction\\Data_Train.xlsx')
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662

In [3]:
test_df=pd.read_excel('F:\\1.Study Materials\\kaggel\\Flight fare prediction\\Test_set.xlsx')
test_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info

In [4]:
final_df=train_df.append(test_df)
final_df.head(2)

C:\Users\Acer\AppData\Local\Temp\ipykernel_5420\889618138.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  final_df=train_df.append(test_df)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0

In [5]:
final_df[final_df.index==74]

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
74,IndiGo,21/03/2019,Delhi,Cochin,DEL → BLR → COK,05:05,10:05,5h,1 stop,No info,6893.0
74,IndiGo,18/05/2019,Mumbai,Hyderabad,BOM → HYD,09:10,10:40,1h 30m,non-stop,No info,NaN

In [6]:
final_df['Date_of_Journey'].value_counts()[:3]

18/05/2019    633
6/06/2019     630
9/05/2019     628
Name: Date_of_Journey, dtype: int64

Hence it is not a time series dataset

In [7]:
## Feature Engineering Process
final_df['date']=final_df['Date_of_Journey'].str.split('/').str[0]
final_df['month']=final_df['Date_of_Journey'].str.split('/').str[1]
final_df['year']=final_df['Date_of_Journey'].str.split('/').str[2]
final_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019

In [8]:
final_df['date']=final_df['Date_of_Journey'].apply(lambda x:x.split('/')[0])
final_df['month']=final_df['Date_of_Journey'].apply(lambda x:x.split('/')[1])
final_df['year']=final_df['Date_of_Journey'].apply(lambda x:x.split('/')[2])
final_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019

In [9]:
final_df.date=final_df.date.astype(int)
final_df.month=final_df.month.astype(int)
final_df.year=final_df.year.astype(int)
# final_df.drop('Date_of_Journey',axis=1,inplace=True)

In [10]:
final_df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019

In [11]:
final_df['Arrival_Time']=final_df['Arrival_Time'].apply(lambda x:x.split(' ')[0])
final_df.Arrival_Time

0       01:10
1       13:15
2       04:25
3       23:30
4       21:35
        ...
2666    20:25
2667    16:55
2668    04:25
2669    19:15
2670    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [12]:
final_df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10,2h 50m,non-stop,No info,3897.0,24,3,2019

In [13]:
final_df.isnull().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2671
date                  0
month                 0
year                  0
dtype: int64

In [14]:
final_df['arival_hour']=final_df['Arrival_Time'].apply(lambda x:x.split(':')[0])
final_df['arival_minutes']=final_df['Arrival_Time'].apply(lambda x:x.split(':')[1])
final_df.drop('Arrival_Time',axis=1,inplace=True)
final_df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897.0,24,3,2019,01,10

In [15]:
final_df['dep_hour']=final_df['Dep_Time'].apply(lambda x:x.split(':')[0])
final_df['dep_minutes']=final_df['Dep_Time'].apply(lambda x:x.split(':')[1])
final_df.drop('Dep_Time',axis=1,inplace=True)
final_df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897.0,24,3,2019,01,10,22,20

In [16]:
final_df['arival_hour']=final_df['arival_hour'].astype(int)
final_df['arival_minutes']=final_df['arival_minutes'].astype(int)
final_df['dep_hour']=final_df['dep_hour'].astype(int)
final_df['dep_minutes']=final_df['dep_minutes'].astype(int)

In [17]:
final_df.Total_Stops.unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [18]:
final_df['Total_Stops']=final_df['Total_Stops'].map({'non-stop':0,'2 stops':2,'1 stop':1,'3 stops':3,'4 stops':4,'nan':1})
final_df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20

In [19]:
final_df.drop('Route',axis=1,inplace=True)
final_df.head(1)

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes
0,IndiGo,24/03/2019,Banglore,New Delhi,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20

In [20]:
final_df.Additional_Info.unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [21]:
final_df[final_df['Duration']=='5m']
# final_df.Duration_hour.to_csv('F:\\1.Study Materials\Krish Naik EDA annd Feature Engineering\Flight\csv--.csv')

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes
6474,Air India,6/03/2019,Mumbai,Hyderabad,5m,2.0,No info,17327.0,6,3,2019,16,55,16,50
2660,Air India,12/03/2019,Mumbai,Hyderabad,5m,2.0,No info,NaN,12,3,2019,16,55,16,50

In [22]:
final_df=final_df[~(final_df['Duration']=='5m')]

In [23]:
final_df['Duration_hour']=final_df['Duration'].apply(lambda x:x.split('h')[0])
final_df.Duration_hour.head()

0     2
1     7
2    19
3     5
4     4
Name: Duration_hour, dtype: object

In [24]:
final_df['Duration_hour']=final_df['Duration_hour'].astype(int)

In [25]:
# To check how meny values in  Duration actualy containing minute
final_df['Duration'].apply(lambda x:x.find('m')==-1).value_counts()

False    12068
True      1284
Name: Duration, dtype: int64

In [26]:
final_df['Duration_min']=final_df['Duration'].apply(lambda x:x[-3:-1] if x.find('m')!=-1 else 0)
final_df['Duration_min']=final_df['Duration_min'].astype(int)

From Observation it seen that there is duplicate values

In [27]:
final_df[final_df.index==74]

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes,Duration_hour,Duration_min
74,IndiGo,21/03/2019,Delhi,Cochin,5h,1.0,No info,6893.0,21,3,2019,10,5,5,5,5,0
74,IndiGo,18/05/2019,Mumbai,Hyderabad,1h 30m,0.0,No info,NaN,18,5,2019,10,40,9,10,1,30

In [28]:
final_df.index=[x for x in range(len(final_df))]
final_df[final_df.index==74]

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes,Duration_hour,Duration_min
74,IndiGo,21/03/2019,Delhi,Cochin,5h,1.0,No info,6893.0,21,3,2019,10,5,5,5,5,0

In [29]:
final_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes,Duration_hour,Duration_min
0,IndiGo,24/03/2019,Banglore,New Delhi,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20,2,50
1,Air India,1/05/2019,Kolkata,Banglore,7h 25m,2.0,No info,7662.0,1,5,2019,13,15,5,50,7,25

In [30]:
final_df.drop('Duration',axis=1,inplace=True)

In [31]:
final_df.head()

,Airline,Date_of_Journey,Source,Destination,Total_Stops,Additional_Info,Price,date,month,year,arival_hour,arival_minutes,dep_hour,dep_minutes,Duration_hour,Duration_min
0,IndiGo,24/03/2019,Banglore,New Delhi,0.0,No info,3897.0,24,3,2019,1,10,22,20,2,50
1,Air India,1/05/2019,Kolkata,Banglore,2.0,No info,7662.0,1,5,2019,13,15,5,50,7,25
2,Jet Airways,9/06/2019,Delhi,Cochin,2.0,No info,13882.0,9,6,2019,4,25,9,25,19,0
3,IndiGo,12/05/2019,Kolkata,Banglore,1.0,No info,6218.0,12,5,2019,23,30,18,5,5,25
4,IndiGo,01/03/2019,Banglore,New Delhi,1.0,No info,13302.0,1,3,2019,21,35,16,50,4,45

In [32]:
final_df[final_df['Duration_hour']==0]

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Total_Stops, Additional_Info, Price, date, month, year, arival_hour, arival_minutes, dep_hour, dep_minutes, Duration_hour, Duration_min]
Index: []

In [33]:
final_df=final_df[final_df['Total_Stops'].isna()==False]

In [34]:
final_df.isna().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Total_Stops           0
Additional_Info       0
Price              2670
date                  0
month                 0
year                  0
arival_hour           0
arival_minutes        0
dep_hour              0
dep_minutes           0
Duration_hour         0
Duration_min          0
dtype: int64

In [35]:
final_df['Total_Stops']=final_df['Total_Stops'].astype(int)

In [36]:
final_df['Duration']=final_df.Duration_hour*60+final_df.Duration_min

In [37]:
def cal(x):
    if (x>=6 and x<12):
        return 'morning'
    elif (x>=12 and x<18):
        return 'after noon'
    elif (x>=18 and x<21):
        return 'evening'
    else:
        return 'night'

In [38]:
final_df['Arival_time']=final_df['arival_hour'].apply(cal)

In [39]:
final_df['Dep_time']=final_df['dep_hour'].apply(cal)

In [40]:
final_df.drop(['arival_hour','arival_minutes','dep_hour','dep_minutes','Duration_hour','Duration_min','Date_of_Journey'],axis=1,inplace=True)

In [41]:
final_df['Additional_Info'].value_counts()

No info                         10490
In-flight meal not included      2426
No check-in baggage included      396
1 Long layover                     20
Change airports                     8
Business class                      5
No Info                             3
1 Short layover                     1
Red-eye flight                      1
2 Long layover                      1
Name: Additional_Info, dtype: int64

In [42]:
final_df.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,date,month,year,Duration,Arival_time,Dep_time
0,IndiGo,Banglore,New Delhi,0,No info,3897.0,24,3,2019,170,night,night
1,Air India,Kolkata,Banglore,2,No info,7662.0,1,5,2019,445,after noon,night

In [43]:
train=final_df[final_df['Price'].isna() == False]

In [44]:
test=final_df[final_df['Price'].isna() == True]

In [45]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

final_df['Airline']=encoder.fit_transform(final_df.Airline)
final_df['Source']=encoder.fit_transform(final_df.Source)
final_df['Destination']=encoder.fit_transform(final_df.Destination)
final_df['Additional_Info']=encoder.fit_transform(final_df.Additional_Info)
final_df['Arival_time']=encoder.fit_transform(final_df.Arival_time)
final_df['Dep_time']=encoder.fit_transform(final_df.Dep_time)

final_df.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,date,month,year,Duration,Arival_time,Dep_time
0,3,0,5,0,8,3897.0,24,3,2019,170,3,3
1,1,3,0,2,8,7662.0,1,5,2019,445,0,3

In [46]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 13351
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13351 non-null  int32
 1   Source           13351 non-null  int32
 2   Destination      13351 non-null  int32
 3   Total_Stops      13351 non-null  int32
 4   Additional_Info  13351 non-null  int32
 5   Price            10681 non-null  float64
 6   date             13351 non-null  int32
 7   month            13351 non-null  int32
 8   year             13351 non-null  int32
 9   Duration         13351 non-null  int32
 10  Arival_time      13351 non-null  int32
 11  Dep_time         13351 non-null  int32
dtypes: float64(1), int32(11)
memory usage: 782.3 KB

In [47]:
df1=pd.get_dummies(train,columns=['Airline','Source','Destination','Additional_Info','Arival_time','Dep_time'],drop_first=True)
df1.head(2)

,Total_Stops,Price,date,month,year,Duration,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,...,Additional_Info_No Info,Additional_Info_No check-in baggage included,Additional_Info_No info,Additional_Info_Red-eye flight,Arival_time_evening,Arival_time_morning,Arival_time_night,Dep_time_evening,Dep_time_morning,Dep_time_night
0,0,3897.0,24,3,2019,170,0,0,1,0,...,0,0,1,0,0,0,1,0,0,1
1,2,7662.0,1,5,2019,445,1,0,0,0,...,0,0,1,0,0,0,0,0,0,1

In [48]:
from sklearn.svm import SVR
from sklearn.linear_model import Lasso,BayesianRidge,MultiTaskLasso,ElasticNet
from sklearn.ensemble import RandomForestRegressor,AdaBoostRegressor,GradientBoostingRegressor,HistGradientBoostingRegressor
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
models=[RandomForestRegressor(),AdaBoostRegressor(),GradientBoostingRegressor(),HistGradientBoostingRegressor(),Lasso(),BayesianRidge(),ElasticNet(),SVR()]

In [49]:
xTrain,xTest,yTrain,yTest=train_test_split(df1.drop('Price',axis=1),df1['Price'],test_size=0.2,random_state=42)
xTrain.head(2)

,Total_Stops,date,month,year,Duration,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,...,Additional_Info_No Info,Additional_Info_No check-in baggage included,Additional_Info_No info,Additional_Info_Red-eye flight,Arival_time_evening,Arival_time_morning,Arival_time_night,Dep_time_evening,Dep_time_morning,Dep_time_night
10610,0,18,5,2019,85,0,0,0,1,0,...,0,0,0,0,0,1,0,0,1,0
1034,1,24,4,2019,380,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,0

In [50]:
def modelTrain(xTrain,yTrain,xTest,yTest,model):
    for i in range(len(model)):
        model[i].fit(xTrain,yTrain)
        pred=model[i].predict(xTest)
        print(f'Model : {model[i]} ---- Accuracy : {r2_score(yTest,pred)}')

In [51]:
modelTrain(xTrain,yTrain,xTest,yTest,models)

Model : RandomForestRegressor() ---- Accuracy : 0.8734872080209086
Model : AdaBoostRegressor() ---- Accuracy : 0.5388431417943892
Model : GradientBoostingRegressor() ---- Accuracy : 0.8441801572093014
Model : HistGradientBoostingRegressor() ---- Accuracy : 0.859539383405366
Model : Lasso() ---- Accuracy : 0.7041695079435165
Model : BayesianRidge() ---- Accuracy : 0.7029118063258522
Model : ElasticNet() ---- Accuracy : 0.459349672425278
Model : SVR() ---- Accuracy : 0.06216230769119013